import matplotlib.pyplot as plt
import numpy as np


"""
===============================================================================================
Рисую графики функций f(x) = sqrt(x + 2) и g(x) = 2 * cos(x):
===============================================================================================

"""


def f(x):
    return (x + 2) ** 0.5


def g(x):
    return 2 * np.cos(x)


"""
x_values = np.arange(0, 5, 0.1)
f_values, g_values = [f(x) for x in x_values], [g(x) for x in x_values]
plt.plot(x_values, f_values, label="f(x) = sqrt(x + 2)")
plt.plot(x_values, g_values, label="g(x) = 2 * cos(x)")
plt.xlabel("x")
plt.ylabel("y")
plt.legend()
plt.grid(True)
plt.show()
"""
# Корень уравнения лежит в отрезке [0.5; 1], исходя из графиков


"""
===============================================================================================
Применим метод половинного деления для нахождения корня уравнения f(x) = g(x):
===============================================================================================

"""


def h(x):
    return f(x) - g(x)


a, b = 0.5, 1
eps = 0.1
k = 0
while abs(b - a) > 2 * eps:
    x = (a + b) / 2
    if h(x) * h(a) < 0:
        b = x
    else:
        a = x
    print(
        f"k = {k}, a = {a}, b = {b}, x = {x}, h(a) = {h(a)}, h(b) = {h(b)}, h(x) = {h(x)}, |b - a| = {abs(b - a)}"
    )
    print("-----------------------------")
    k += 1

# Беру отрезок [0.625; 0.75]


"""
===============================================================================================
Метод простой итерации:
===============================================================================================

"""

# Целевая точность
eps = 1e-10


# Производная функции h(x) для проверки условия сходимости и поиска константы
def dh(x):
    return 1 / (2 * (x + 2) ** 0.5) + 2 * np.sin(x)


# Находим минимум и максимум производной на суженном отрезке [a, b]
# Так как функция производной монотонно возрастает на этом отрезке:
m = dh(a)  # Минимум
M = dh(b)  # Максимум

# Выбираем оптимальный параметр c
c = -2 / (M + m)


# Определяем функцию phi(x) для канонического вида x = phi(x)
def phi(x):
    return x + c * h(x)


# В качестве начального приближения возьму середину отрезка [a, b]
x_k = (a + b) / 2
k = 0

print("Метод простой итерации")
print(f"{'Номер':<10} | {'Метод простой итерации':^35}")
print(f"{'итерации k':<10} | {'x^k':<16} | {'|x^k - x^{k-1}|':<16}")
print("-" * 48)

print(f"{k:<10} | {x_k:<16.10f} | {'-':^16}")

# Итерационный процесс
while True:
    k += 1
    x_prev = x_k
    x_k = phi(x_prev)  # Шаг итерации

    diff = abs(x_k - x_prev)

    # Вывод текущей итерации
    print(f"{k:<10} | {x_k:<16.10f} | {diff:<16.10e}")

    # Критерий остановки
    if diff < eps:
        break

print("-" * 48)
print(f"Корень уравнения (с точностью eps = {eps}): {x_k:.10f}")


"""
===============================================================================================
Метод Ньютона:
===============================================================================================

"""

# Вторая производная функции h(x)
def d2h(x):
    return -0.25 * (x + 2)**(-1.5) + 2 * np.cos(x)

print("\n--- Проверка условий теоремы о сходимости метода Ньютона ---")

# В качестве начального приближения возьму середину отрезка [a, b]
x0 = (a + b) / 2  
f_x0 = h(x0)
df_x0 = dh(x0)

h0 = - f_x0 / df_x0

# Определяем границы отрезка s_0
s0_start = min(x0, x0 + 2 * h0)
s0_end = max(x0, x0 + 2 * h0)

# Максимум модуля второй производной на отрезке s_0.
# Поскольку d2h(x) на этом интервале монотонно убывает, 
# максимум модуля будет на одном из концов отрезка s_0
M_newton = max(abs(d2h(s0_start)), abs(d2h(s0_end)))

condition_left = 2 * abs(h0) * M_newton
condition_right = abs(df_x0)

print(f"Начальное приближение x_0 = {x0}")
print(f"h_0 = -f(x_0)/f'(x_0) = {h0:.5f}")
print(f"Отрезок s_0: [{s0_start:.5f}, {s0_end:.5f}]")
print(f"M = max |f''(x)| на s_0 = {M_newton:.5f}")
print(f"Проверяем неравенство 2*|h_0|*M <= |f'(x_0)|:")
print(f"{condition_left:.5f} < {condition_right:.5f}")

if condition_left <= condition_right:
    print("ВЫВОД: Условие теоремы выполняется. Метод Ньютона гарантированно сходится!\n")
else:
    print("ВЫВОД: Условие не выполняется. Возможны проблемы со сходимостью.\n")


# РЕАЛИЗАЦИЯ МЕТОДА НЬЮТОНА
x_k_newton = x0
k_iter_newton = 0

print("Метод Ньютона")
print(f"{'Номер':<10} | {'Метод Ньютона':^35}")
print(f"{'итерации k':<10} | {'x^k':<16} | {'|x^k - x^{k-1}|':<16}")
print("-" * 48)

# Нулевая итерация
print(f"{k_iter_newton:<10} | {x_k_newton:<16.10f} | {'-':^16}")

while True:
    k_iter_newton += 1
    x_prev_newton = x_k_newton
    
    # Формула метода Ньютона (стр. 11, формула 2)
    x_k_newton = x_prev_newton - h(x_prev_newton) / dh(x_prev_newton)
    
    diff_newton = abs(x_k_newton - x_prev_newton)
    
    # Вывод текущей итерации
    print(f"{k_iter_newton:<10} | {x_k_newton:<16.10f} | {diff_newton:<16.10e}")
    
    # Критерий остановки с заданной точностью 10^{-10}
    if diff_newton < eps:
        break

print("-" * 48)
print(f"Корень уравнения (с точностью eps = {eps}): {x_k_newton:.10f}")


"""
===============================================================================================
Метод секущих:
===============================================================================================

"""

# Для метода секущих нужны два начальных приближения: x^0 и x^1
# Возьмем концы отрезка[a, b]
x_prev_sec = b  # это будет x^0
x_curr_sec = a  # это будет x^1

k_iter_sec = 0

print("\nМетод секущих")
print(f"{'Номер':<10} | {'Метод секущих':^35}")
print(f"{'итерации k':<10} | {'x^k':<16} | {'|x^k - x^{k-1}|':<16}")
print("-" * 48)

# Вывод нулевой итерации k = 0
print(f"{k_iter_sec:<10} | {x_prev_sec:<16.10f} | {'-':^16}")

# Вывод первой итерации k = 1
k_iter_sec += 1
diff_sec = abs(x_curr_sec - x_prev_sec)
print(f"{k_iter_sec:<10} | {x_curr_sec:<16.10f} | {diff_sec:<16.10e}")

# Итерационный процесс для k = 2, 3, ...
while True:
    k_iter_sec += 1

    # Значения функции в точках x^{k-1} и x^k
    f_prev = h(x_prev_sec)
    f_curr = h(x_curr_sec)

    # Формула метода секущих
    x_next_sec = x_curr_sec - f_curr * (x_curr_sec - x_prev_sec) / (f_curr - f_prev)

    diff_sec = abs(x_next_sec - x_curr_sec)

    # Вывод текущей итерации
    print(f"{k_iter_sec:<10} | {x_next_sec:<16.10f} | {diff_sec:<16.10e}")

    # Сдвигаем точки для следующего шага
    x_prev_sec, x_curr_sec = x_curr_sec, x_next_sec

    # Критерий остановки с заданной точностью 10^{-10}
    if diff_sec < eps:
        break

print("-" * 48)
print(f"Корень уравнения (с точностью eps = {eps}): {x_curr_sec:.10f}")
